; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph4 - mode
	image7 - mode
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph5 - mode
	spectrograph3 - mode
	image6 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph3)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 spectrograph3)
	(supports instrument2 image7)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Star5 spectrograph4)
	(have_image Planet6 spectrograph3)
	(have_image Phenomenon7 image7)
	(have_image Planet8 spectrograph0)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 image6)
	(have_image Star10 image1)
	(have_image Star10 spectrograph5)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
2. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 9
3. (turn_to satellite1 planet6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet6)
   goals met: 0 of 9
4. (take_image satellite1 planet6 instrument2 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 9
6. (turn_to satellite0 star2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star2)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon7 instrument2 image7)
   added: (have_image phenomenon7 image7)
   goals met: 2 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 9
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 9
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 9
12. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   goals met: 2 of 9
13. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 3 of 9
14. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
15. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 4 of 9
16. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 9
17. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
18. (turn_to satellite0 groundstation3 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation3)
   goals met: 4 of 9
19. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 9
20. (turn_to satellite0 phenomenon9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 9
21. (take_image satellite0 phenomenon9 instrument1 image6)
   added: (have_image phenomenon9 image6)
   goals met: 5 of 9
22. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 9
23. (take_image satellite0 planet8 instrument1 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 6 of 9
24. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 6 of 9
25. (take_image satellite0 star5 instrument1 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 7 of 9
26. (turn_to satellite1 groundstation3 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation3)
   goals met: 7 of 9
27. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 7 of 9
28. (turn_to satellite1 phenomenon9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 9
29. (take_image satellite1 phenomenon9 instrument3 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 8 of 9
30. (turn_to satellite1 star10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star10)
   goals met: 8 of 9
31. (take_image satellite1 star10 instrument3 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 9 of 9
